Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྟག་པ་ཡིན་ནམ། མི་རྟག་པ་ཡིན།
en: “Great King, what do you think—is material form permanent, or is it, rather, impermanent?”

source: གསོལ་པ་བཙུན་པ་དེ་ནི་མི་རྟག་པ་ལགས་སོ། །
en: “Lord, it is impermanent,” he replied.

source: བཀའ་སྩལ་པ། མི་རྟག་པ་གང་ཡིན་པ་དེ་སྡུག་བསྔལ་བ་ཡིན་ནམ། སྡུག་བསྔལ་བ་མ་ཡིན།
en: “And that which is impermanent—is it suffering, or is it, rather, not suffering?”

source: གསོལ་པ། བཙུན་པ་དེ་ནི་སྡུག་བསྔལ་བ་ལགས་སོ། །
en: “Lord, it is suffering,” he replied.

source: བཀའ་སྩལ་པ། མི་རྟག་ཅིང་སྡུག་བསྔལ་ལ། རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན་གང་ཡིན་པ་དེ་ལ་ཅི་ཐོས་པ་དང་ལྡན་པའི་འཕགས་པ་ཉན་ཐོས་བདག་ཏུ་འཛིན་ཅིང་། འདི་ནི་བདག་གི་ཡིན་ནོ། །འདི་ནི་བདག་ཡིན་ནོ། །
en: “Regarding those things that are impermanent and, therefore, suffering—do noble listeners, educated in the teachings, hold them to be a self

source: འདི་ནི་བདག་གི་བདག་ཡིན་ནོ་སྙམ་དུ་འཛིན་ཏམ།
en: and grasp at the thought that they are their possession, them, or their self?”

source: གསོལ་པ། བཙུན་པ་དེ་ནི་མ་ལགས་སོ། །
en: “Lord, they do not,” he replied.

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་སྙམ་དུ་སེམས།
en: “Great King, what do you think—

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྟག་པ་ཡིན་ནམ། མི་རྟག་པ་ཡིན།
en: are sensations, perceptions, formations, and consciousness permanent or impermanent?”

source: གསོལ་པ། བཙུན་པ་དེ་ནི་མི་རྟག་པ་ལགས་སོ། །
en: “Lord, they are impermanent,” he replied.

source: བཀའ་སྩལ་པ། མི་རྟག་ཅིང་སྡུག་བསྔལ་ལ། རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན་གང་ཡིན་པ་དེ་ལ། ཅི་ཐོས་པ་དང་ལྡན་པའི་འཕགས་པ་ཉན་ཐོས་བདག་ཏུ་འཛིན་ཅིང་། འདི་ནི་བདག་གི་ཡིན་ནོ། །འདི་ནི་བདག་ཡིན་ནོ། །འདི་ནི་བདག་གི་བདག་ཡིན་ནོ་སྙམ་དུ་འཛིན་ཏམ།
en: Then the Blessed One asked, “Regarding those things that are impermanent and, therefore, suffering—do noble listeners, educated in the teachings, hold them to be a self and grasp at the thought that they are their possession, them, or their self?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་བས་ན་གཟུགས་གང་ཡང་རུང་སྟེ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་ནང་གིའམ། ཕྱི་རོལ་གྱིའམ། རགས་པའམ། ཆ་ཕྲ་བའམ། ངན་པའམ། བཟང་པོའམ། ཉེ་བའམ། རིང་བ་གང་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་བདག་གི་ཡང་མ་ཡིན། དེ་ནི་བདག་ཀྱང་མ་ཡིན། དེ་ནི་བདག་གི་བདག་ཀྱང་མ་ཡིན་ཏེ།
en: “Great King,” the Blessed One then said, “that is why no form—whether past, present, or future; inner or outer; gross or subtle; bad or good; near or far away—could possibly be a possession, them, or their self.

source: དེ་ཁོ་ན་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་བལྟ་བར་བྱའོ། །
en: Thus should you regard them, with perfect wisdom.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་གང་ཡང་རུང་སྟེ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་ནང་གིའམ། ཕྱི་རོལ་གྱིའམ། རགས་པའམ། ཆ་ཕྲ་བའམ། ངན་པའམ། བཟང་པོའམ། ཉེ་བའམ། རིང་བ་གང་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་བདག་གི་ཡང་མ་ཡིན། དེ་ནི་བདག་ཀྱང་མ་ཡིན། དེ་ནི་བདག་གི་བདག་ཀྱང་མ་ཡིན་ཏེ།
en: Neither could sensations, nor perceptions, nor formations, nor consciousness—whether past, present, or future; inner or outer; gross or subtle; bad or good; near or far away—possibly be a possession, them, or their self.

source: དེ་ཁོ་ན་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ། ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་བལྟ་བར་བྱའོ། །
en: Thus should you regard them, with perfect wisdom.

source: དེ་ལྟར་མཐོང་བའི་ཐོས་པ་དང་ལྡན་པའི་འཕགས་པ་ཉན་ཐོས་ནི་གཟུགས་ལས་སྐྱོ་བར་འགྱུར་རོ། །
en: “Noble listeners, educated in the teachings, who see thus, will become disillusioned with material forms.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལས་སྐྱོ་བར་འགྱུར་རོ། །
en: They will become disillusioned with sensations, perceptions, formations, and consciousness.

source: སྐྱོ་ན་མ་ཆགས་པར་འགྱུར་རོ། །
en: In their disillusionment they will cling to nothing.

source: མ་ཆགས་ན་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ། །
en: And when they cling to nothing, they will be liberated.

source: རྣམ་པར་གྲོལ་ན་བདག་ནི་རྣམ་པར་གྲོལ་ལོ་སྙམ་དུ་ཡེ་ཤེས་གཟིགས་པ་འཇུག་སྟེ།
en: Thus liberated, they will think, ‘I have been liberated. My wisdom and vision are manifest.

source: བདག་གི་སྐྱེ་བ་ནི་ཟད་དོ། །
en: I have exhausted my rebirths.

source: སྲིད་པ་འདི་ལས་གཞན་མེད་དོ་སྙམ་དུ་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ། །
en: I shall know no other existence.’ And thinking thus, their wisdom and vision will manifest.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ལ་སོགས་པ་ལྷ་བརྒྱད་ཁྲི་དང་། ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །
en: When this Dharma teaching had been explained, King Bimbisāra of Magadha and the others—the eighty thousand gods and the thousands upon thousands of brahmins and householders of Magadha—were able to see these things unobscured, with the Dharma vision that has no trace of dust or stain with respect to phenomena.

source: དེ་ནས་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོས་ཆོས་མཐོང་།
en: King Bimbisāra of Magadha had perceived the truths,

source: ཆོས་རྙེད།
en: discovered the truths,

source: ཆོས་རྟོགས།
en: realized the truths,

source: སོམ་ཉི་ལས་བརྒལ། ཐེ་ཙོམ་ལས་བརྒལ་ཏེ།
en: until whatever doubt and hesitation he had he overcame.

source: གཞན་གྱི་དྲིང་མི་འཇོག་ཅིང་གཞན་གྱིས་ཀྲི་བ་མེད་ལ་སྟོན་པའི་བསྟན་པའི་ཆོས་རྣམས་ལ་མི་འཇིགས་པ་ཐོབ་ནས་སྟན་ལས་ལངས་ཏེ་
en: Then, of his own accord, completely unprompted, and unafraid of the truths his teacher had shown him, he rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས
en: drew down the right shoulder of his upper garment,

source: བཙུན་པ་བདག་ནི་འཕགས་ལགས་སོ། །
en: “Lord, I have become a noble one.

source: འཕགས་ལགས་སོ། །
en: I am a noble one.

source: བཙུན་པ་བདག་ནི་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: Lord, I take refuge in the Buddha, the Dharma, and the Saṅgha of those gone forth.

source: བདག་དེང་སླན་ཆད་ཇི་སྲིད་འཚོའི་བར་དུ་ཁོང་ནས་དད་པའི་དགེ་བསྙེན་ལགས་པར་གཟུང་དུ་གསོལ།
en: Please accept me as a faithful lay vow holder, from the depths of my heart, from this day forth, for as long as I live.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་སུ་གསོལ།
en: “Blessed One, I beseech you, please come to Rājagṛha.

source: བདག་གིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་བསྙེན་བཀུར་བགྱིའོ། །
en: I shall offer my respect and service to the Blessed One and the saṅgha of those gone forth.

source: ཇི་སྲིད་འཚོའི་བར་དུ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པའི་ན་བཟའ་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། སྟན་དང་། སྙུན་གསོས་དང་། སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ལོ་ཞེས་གསོལ་ཏོ། །
en: For as long as I live, please permit me to provide the Blessed One and the saṅgha of those gone forth with provisions of clothing, food, bedding, seats, and medicines for the sick.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ་སོགས་པ་ལྷ་བརྒྱད་ཁྲི་དང་ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་དང་། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་དང་། གཞི་དེ་ལས་
en: “Tell us why the Blessed One led King Bimbisāra and the rest of the eighty thousand gods and thousands upon thousands of brahmins and householders of Magadha to go for refuge and established them in the fundamental precepts and the unsurpassed, supreme welfare of nirvāṇa,

source: བཅོམ་ལྡན་འདས་ཀྱི་གྲགས་པས་འཇིག་རྟེན་ཀུན་ཏུ་རྒྱས་པར་གྱུར་པ་ལ་གཟིགས།
en: and how it was cause for the fame of the Blessed One to spread throughout the entire world.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ལ་སོགས་པ་ལྷ་བརྒྱད་ཁྲི་དང་། ཡུལ་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་མང་པོ་འདི་རྣམས་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ངས་ཇི་ལྟར་བཀོད་པ་དང་། གཞི་དེས་ན་ངའི་གྲགས་པས་འཇིག་རྟེན་དུ་རྒྱས་པར་གྱུར་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I placed King Bimbisāra and the rest of the eighty thousand gods and thousands upon thousands of brahmins and householders of Magadha in the four meditative states and the five superknowledges, and set them on the path of the ten virtuous actions, which was cause for my fame to spread throughout the entire world. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་རྡུལ་ལྡན་ཞེས་བྱ་བ་ན། རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ། དེའི་རིང་ལ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་དང་།
en: “Monks, in times gone by, during King Diśāṃpati’s reign in the city of Pāṁśula the kingdom was prosperous, flourishing, happy, and well populated. The harvest was good.

source: རྩོད་པ་དང་། འཐབ་པ་ཞི་བ་དང་། འཁྲུག་པ་དང་། ནང་འཁྲུག་དང་། ཆོམ་རྐུན་དང་། ནད་དང་། མུ་གེ་མེད་པ་དང་། འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་། བ་ལང་དང་། མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine. Rice, sugarcane, cattle, and buffalo were plentiful.

source: དེ་ནས་རྒྱལ་པོ་དེ་བཙུན་མོ་དང་། ལྷན་ཅིག་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་བཙུན་མོ་ལ་བུ་ཆགས་ནས།
en: “As he and the queen enjoyed themselves and coupled, one day the queen conceived.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། མིང་རྡུལ་ཞེས་བྱ་བར་བརྟགས་སོ། །
en: At the elaborate feast celebrating his birth they named him Reṇu.

source: དེ་ནས་ཁྱེའུ་རྡུལ་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་། ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་། དྲི་མ་འཁྲུ་བའི་མ་མ་གཉིས་དང་། རྩེ་བའི་མ་མ་གཉིས་ཏེ། མ་མ་བརྒྱད་ལ་གཏད་ནས།
en: “Prince Reṇu was brought up with two nurses to hold him in their laps, two wet nurses, two nurses to bathe him, and two nurses to play with him—eight nurses in all.

source: དེ་མ་མ་བརྒྱད་ཀྱིས། འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུ་དང་། གཞན་ཡང་ཡོ་བྱད་ཀྱི་ཁྱད་པར་བཟང་ངོ་ཅོག་གིས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and furthermore on every good thing he needed,

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ།
en: “As the young man grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train,

source: གླང་པོ་ཆེ་བཞོན་པ་དང་། རྟ་བཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕོང་དང་། མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་ཐར་བར་བྱ་བ་དང་། ལྕགས་ཀྱུས་གཟུང་བ་དང་། ཞགས་པས་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟབས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲགས་པར་འཕང་བ་དང་། གནད་དུ་ཕོག་པ་དང་། གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་། ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་བསླབས་ནས་གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ། །
en: such as how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage. By the time he had been educated in all of these, he was learned in the five fields of knowledge.

source: རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོའི་མདུན་ན་འདོན་ནི་བྲམ་ཟེ་ཁྱིམ་བདག་ཁྱབ་འཇུག་ཅེས་བྱ་བ་ཡིན་ཏེ།
en: “King Diśāṃpati’s magistrate was a brahmin householder named Govinda,

source: དེ་ཡང་མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ། རྩིས་མགོའི་ཐབས་ཤེས་པའི་ཤེས་རབ་དང་། དཔྱོད་པ་དང་ལྡན་པ་ཞིག་སྟེ།
en: who was capable, clear-minded, and trustworthy, an intelligent person with deep knowledge of methods of accounting.

source: དེ་རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོའི་རྒྱལ་པོའི་ཕྲིན་ལས་སུ་བྱ་བ་ཐམས་ཅད་བྱེད་ལ། རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོས་ཀྱང་། མདུན་ན་འདོན་བྲམ་ཟེ་ཁྱབ་འཇུག་དེ་ལ་རྒྱལ་སྲིད་གཏད་ནས།
en: Since King Diśāṃpati’s magistrate, the brahmin householder Govinda, was already administering all his righteous works, he put the kingdom in his hands as well,

source: ཁང་བཟངས་ཀྱི་སྟེང་ན་འདུག་ཅིང་བུད་མེད་འབའ་ཞིག་དང་། སིལ་སྙན་གྱིས་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: and himself stayed up on the roof of his palatial home in the company of women, playing music, enjoying himself, and coupling.

source: ཕྱི་ཞིག་ན་བྲམ་ཟེ་ཁྱབ་འཇུག་གི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: “One day the brahmin Govinda’s wife conceived,

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ། ཁྱེའུའི་མིང་མེ་སྐྱོང་ཞེས་བཏགས་སོ། །
en: At the elaborate feast celebrating his birth they named him Guardian of the Flame.

source: དེ་ནས་ཁྱེའུ་མེ་སྐྱོང་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: “They reared young Guardian of the Flame on milk, yogurt, butter, ghee, and milk solids,

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཡི་གེ་དང་། བྲམ་ཟེའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་དོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས། ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེ།
en: and as he grew up he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda, how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, he became a master of the six types of brahminical activities,

source: དེ་ནས་དེའི་ཕས་ཁྱེའུ་མེ་སྐྱོང་ལ་སྨྲས་པ།
en: “Soon after, Guardian of the Flame’s father said to him,

source: བུ་ཁྱོད་ནི་ཡབ་འདས་པའི་འོག་ཏུ་ཡབ་ཀྱི་ཐབས་ཀྱི་རྒྱལ་སར་འཇུག་པར་འགྱུར་ལ།
en: ‘Son, after I, your father, pass away you will take over my position in the kingdom,

source: ཁྱོད་ནི་འདིའི་མདུན་ན་འདོན་དུ་འགྱུར་གྱི།
en: and you will become its magistrate.

source: འདི་ལ་ཁྱོད་ཀྱིས་སྐོར་ཅིག །
en: You should tour this kingdom.

source: སྔ་ནས་བསྐོར་དང་། ཁྱོད་ལ་འབྲས་བུ་ཡོད་པར་འགྱུར་རོ། །
en: You have not toured it before, and it would be good for you to do so.’

source: མེ་སྐྱོང་གིས་སྨྲས་པ། ཇོ་བོས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ་ཞེས་སྨྲས་ནས།
en: “ ‘I shall do as my lord instructs,’ Guardian of the Flame replied,

source: གཞོན་ནུ་རྡུལ་གྱི་ཕྱི་བཞིན་དུ་གྲིབ་མ་བཞིན་དུ་འབྲང་ངོ་། །
en: and he began to follow Prince Reṇu about like a shadow.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་ཁྱབ་འཇུག་ཤི་ནས།
en: “One day the brahmin Govinda died,

source: དེ་ཤི་བའི་ཕྱིར་རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོ་ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་། སྡུག་བསྔལ་ལ་སྨྲེ་སྔགས་འདོན་པར་བྱེད་དོ། །
en: and on account of his death Diśāṃpati began to grieve and suffer greatly, wailing and lamenting,

source: དེ་ནས་གཞོན་ནུ་རྡུལ་གྱིས་གསོལ་པ། ལྷ་ཁྱོད་ཅིའི་སླད་དུ་བྲམ་ཟེ་ཁྱབ་འཇུག་གུམ་པའི་སླད་དུ། ཤིན་ཏུ་ཐུགས་ངན་མཛད་ཅིང་འོ་བརྒྱལ་ལ། སྨྲེ་སྔགས་འདོན་ཅིང་བཞུགས།
en: whereupon Prince Reṇu asked the king, ‘Deva, why do you sit there, weary from wailing and mourning in despair over the brahmin Govinda’s passing?’

source: བྲམ་ཟེ་ཁྱབ་འཇུག་ནི་ངའི་རྒྱལ་པོའི་ཕྲིན་ལས་སུ་བྱ་བ་ཐམས་ཅད་བྱེད་བྱེད་དེ།
en: ‘The brahmin Govinda administers each and every righteous deed of my kingdom.

source: དེའི་མཐུས་པའི་སྙིང་ཁྲལ་ཆུང་ངུར་འདུག་གོ། །
en: It’s on his account that my heart shrinks with grief.’

source: གཞོན་ནུ་རྡུལ་གྱིས་གསོལ་པ། ལྷ་ཁྱོད་བྲམ་ཟེ་ཁྱབ་འཇུག་གུམ་པའི་སླད་དུ་ཧ་ཅང་ཐུགས་ངན་མ་མཛད།
en: “ ‘Deva,’ Prince Reṇu said, ‘don’t grieve so over the passing of the brahmin Govinda.

source: ཧ་ཅང་འོ་བརྒྱལ་བར་མ་མཛད་ཧ་ཅང་སྨྲེ་སྔགས་འདོན་པར་མ་མཛད་ཅིག་དང་།
en: Don’t weary yourself so. Don’t wail so.

source: ལྷ་མཁན་པོ་དེ་ཉིད་ཀྱི་བུ་བྲམ་ཟེའི་ཁྱེའུ་མེ་སྐྱོང་ཞེས་བགྱི་བ། ཕ་བས་ཀྱང་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་ཞིག་མཆིས་པ་དེ།
en: Deva, your counselor’s own son, the young brahmin called Guardian of the Flame, is far more exalted than even his father.

source: ལྷས་མདུན་ན་འདོན་དུ་བསྐོ་བར་གསོལ།
en: Deva, I urge you, appoint him as your magistrate,

source: འོན་ཏང་དེས་ལྷའི་རྒྱལ་པོའི་ཕྲིན་ལས་སུ་བགྱི་བ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ། །
en: that he might administer all the righteous works of the kingdom for you.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོས། བྲམ་ཟེའི་ཁྱེའུ་མེ་སྐྱོང་དགུག་པ་བཏང་ནས་མདུན་ན་འདོན་དུ་བཅུག་གོ། །
en: “No sooner had King Diśāṃpati heard this than he sent for the young brahmin Guardian of the Flame and appointed him magistrate,

source: དེ་ནས་དེས་ཀྱང་རྒྱལ་པོ་དེའི་བྱ་བ་ཐམས་ཅད་ཉམས་སུ་བླངས་སོ། །
en: whereupon he likewise took over all the king’s duties.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཕྱོགས་ཀྱི་བདག་པོས། གཞོན་ནུ་རྡུལ་རྒྱལ་སར་བཅུག་ནས། ཕྱོགས་ཀྱི་བདག་པོ་ཤིའོ། །
en: One day, after ceding the throne to Prince Reṇu, Diśāṃpati died.

source: དེ་ནས་དེའི་མིང་གཞོན་ནུ་རྡུལ་ཞེས་བྱ་བ་དེ་མེད་པར་གྱུར་ནས། རྒྱལ་པོ་རྡུལ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: From then on he was no longer called Prince Reṇu, but King Reṇu.

source: དེ་ནས་རྒྱལ་པོ་རྡུལ་གྱིས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་མེ་སྐྱོང་དགུག་པ་བཏང་ནས། དེ་ལ་སྨྲས་པ།
en: “King Reṇu summoned the young brahmin Guardian of the Flame and told him,

source: མཁན་པོ་ཁྱོད་ཀྱིས་ཅི་ལྟར་ངའི་ཡབ་ཀྱི་རྒྱལ་པོའི་ཕྲིན་ལས་སུ་བྱ་བ་ཐམས་ཅད་བྱས་པ་དེ་བཞིན་དུ་ངའི་ཡང་གྱིས་ཤིག །
en: ‘Counselor, may you carry out all the righteous works of my kingdom just as you did those of my father.’

source: བྲམ་ཟེའི་ཁྱེའུས་གསོལ་པ། ལྷ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་གསོལ་ནས
en: “ ‘As you wish, Deva,’ the young brahmin replied.

source: བྲམ་ཟེའི་ཁྱེའུ་མེ་སྐྱོང་གིས་རྒྱལ་པོ་རྡུལ་གྱི་རྒྱལ་སྲིད་ཀྱི་བྱ་བ་ཐམས་ཅད་ཉམས་སུ་བླངས་སོ། །
en: “The brahmin Guardian of the Flame took on all King Reṇu’s royal duties,

source: དེ་ནས་དེའི་མིང་མེ་སྐྱོང་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་མེད་པར་གྱུར་ནས། མེ་སྐྱོང་ཁྱབ་འཇུག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: after which he was no longer called Guardian of the Flame, but Guardian of the Flame Govinda.

source: དེའི་ཚེ་རྒྱལ་པོ་རྡུལ་གྱི་སྔོན་གཞོན་ནུའི་ཚེ། མཛའ་ཞིང་བཤེས་ལ་གཅུགས་པ། རྒྱལ་རིགས་གཞོན་ནུ་དྲུག་ཅིག་ཡོད་པ་དེ་དག །རྒྱལ་པོ་དེའི་ཐད་དུ་འོངས་ནས་སྨྲས་པ།
en: At that time, while King Reṇu was still young, friendly, and companionable, there were six princes of the warrior class who came before the king and said,

source: ལྷས་བདག་ཅག་གི་ཡུལ་དབོག་ཏུ་གསོལ།
en: ‘Deva, we ask that you bestow to us our own countries.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོས་མེ་སྐྱོང་ཁྱབ་འཇུག་ལ་བཀའ་སྩལ་ཏེ།
en: “As soon as the king heard this, he told Guardian of the Flame Govinda,

source: མཁན་པོ་ཁྱོད་ཀྱིས་ས་ཆེན་པོ་འདི་ཆ་བདུན་དུ་བགོས་ལ།
en: ‘Counselor Govinda , divide this great land into seven parts.

source: ཆ་དྲུག་ནི་གཞོན་ནུ་འདི་རྣམས་ལ་བྱིན་ཅིག །ཆ་གཅིག་ནི་ངའི་བྱའོ། །
en: Give six parts to these princes, and let one be mine.’

source: དེས་གསོལ་པ། ལྷ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་བྱས་ནས།
en: “ ‘As you wish, Deva,’ he replied.

source: མེ་སྐྱོང་ཁྱབ་འཇུག་གིས་ས་ཆེན་པོ་འདི་ཆ་བདུན་དུ་བགོས་ཏེ།
en: “Then Guardian of the Flame Govinda divided that great land into seven parts,

source: ཆ་དྲུག་ནི་གཞོན་ནུ་དྲུག་པོ་རྣམས་ལ་བྱིན་ནོ། །
en: giving six parts to the princes,

source: ཆ་གཅིག་ནི་རྒྱལ་པོ་རྡུལ་གྱི་སྐལ་བར་ལུས་ཤིང་འདུག་གོ། །
en: with one part remaining as King Reṇu’s share.

source: དེ་ནས་རྒྱལ་པོ་རྡུལ་གྱིས་རྒྱལ་རིགས་དྲུག་པོ་དེ་དག་རང་རང་གི་རྒྱལ་སྲིད་ལ་བཀོད་དོ། །
en: King Reṇu appointed each of the six warriors to his own kingdom,

source: དེ་ནས་མེ་སྐྱོང་ཁྱབ་འཇུག་ནི་འཛམ་བུའི་གླིང་དུ་ཚངས་པར་བཀུར་ཏེ།
en: and Guardian of the Flame Govinda was esteemed as Brahmā in Jambudvīpa.

source: བྲམ་ཟེ་ཁྱབ་འཇུག་ནི་ཚངས་པའི་ལམ་ཡིན་ནོ་སྙམ་དུ་འཛིན་ཅིང་། ཚངས་པའི་ལམ་ཡིན་པར་བལྟའོ། །
en: The people held Guardian of the Flame Govinda as the way to Brahmā, and regarded him as such.

source: དེ་ནས་ཕྱི་ཞིག་ན། བྲམ་ཟེ་ཁྱབ་འཇུག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “One day the brahmin Govinda thought,

source: བདག་ནི་རྒྱལ་ཁམས་ཐམས་ཅད་ཀྱི་མི་རྣམས་ཀྱིས་ཚངས་པར་བཀུར་ཏེ།
en: ‘People throughout the kingdoms esteem me as Brahmā,

source: བྲམ་ཟེ་ཁྱབ་འཇུག་ནི་ཚངས་པའི་ལམ་ཡིན་ནོ་སྙམ་དུ་འཛིན་ཅིང་། ཚངས་པའི་ལམ་ཡིན་པར་ལྟ་ལ།
en: think that I am the way to Brahmā, and regard me as such.

source: གནའི་བྲམ་ཟེ་རྒས་ཤིང་འཁོགས་ལ་གཏུགས་པ།
en: Old brahmin Viṣṇu is aged and infirm,

source: སྡེ་ཚན་གྱི་སློབ་དཔོན་ཆེན་པོ་དག་ལས་བདག་གིས་ཐོས་ནབྲམ་ཟེ་གང་གིས་དབྱར་ཟླ་བ་བཞིའི་བར་དུ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཀྱིས་གནས་པ་དེ་ལ།
en: and I’ve heard from the masters of our group that Sahāṃpati Brahmā will come to see a brahmin who keeps his mind full of love throughout the four months of the rainy season.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བལྟར་འོང་ངོ་ཞེས་ཟེར་གྱིས་མ་ལ་བདག་གིས་ཐམས་ཅད་སྤངས་ཏེ
en: Therefore I shall cast all else aside and

source: ཁང་བཟངས་ཀྱི་སྟེང་དུ་སོང་ལ། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཀྱིས་གནས་པར་བྱ་གོར་མ་ཆག་སྙམ་ནས།
en: go to the roof of the palace to dwell amid thoughts of love, compassion, joy, and equanimity.’

source: རྒྱལ་པོ་ལ་གསོལ་པ། ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། བདག་ནི་དབྱར་ཟླ་བ་བཞི་ཚངས་པའི་གནས་ཀྱིས་གནས་པར་འཚལ་ཏེ།
en: “He told the king, ‘Deva, please know, for the four months of the rainy season I wish to abide in the domain of Brahmā.

source: དེ་བས་ན་ལྷས་ལྷ་ཉིད་ཀྱི་རྒྱལ་པོའི་ཕྲིན་ལས་སུ་བགྱི་བ་གང་ལགས་པ་ཐམས་ཅད་བགྱིད་པའི་མདུན་ན་འདོན་གཞན་ཞིག་བསྒོ་བར་གསོལ་ཞེས་སྨྲས་སོ། །
en: Therefore, Deva must appoint another magistrate to carry out all the righteous works of the kingdom.’

source: དེ་ནས་རྒྱལ་པོ་རྡུལ་གྱིས་སྨྲས་པ། ཁྱོད་ཅི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བྱའོ། །
en: “ ‘As you wish,’ King Reṇu said.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྲམ་ཟེ་ཁྱབ་འཇུག་ཆེན་པོས་ལས་སུ་བྱ་བ་ཐམས་ཅད་སྤངས་ནས།
en: “No sooner had the brahmin Mahā­govinda heard this than he cast aside all his duties,

source: ཁང་བཟངས་ཀྱི་སྟེང་དུ་སོང་སྟེ། ཁང་བཟངས་ཀྱི་སྟེང་ན་འདུག་ཅིང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཀྱིས་གནས་སོ། །
en: went to the roof of the palace, and there on the roof dwelt amid thoughts of love, compassion, joy, and equanimity.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བལྟར་འོངས་ནས།
en: Finally, one day Sahāṃpati Brahmā came to see him,

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའི་ཁ་དོག་གི་མཐུས། ཁང་བཟངས་དེ་དག་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: and because of Sahāṃpati Brahmā’s appearance the roof of the palace was completely bathed in light.

source: དེ་ནས་དེ་མཐོང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: When he saw this the brahmin Mahā­govinda said in verse:

source: བདག་གིས་ཁ་དོག་འདི་འདྲ་བ། །སྔོན་ཅད་མ་ཐོས་མ་མཐོང་སྟེ། །
en: “ ‘Never before have I heard of or seen A color as beautiful as this.

source: ཁ་དོག་བཟང་ཞིང་གཟུགས་བཟང་བ། །གྲོགས་པོ་ཁྱོད་ནི་སུ་ཞིག་ལགས། །
en: A brilliant mien, a brilliant form— Pray tell me, my friend, who you are.’

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་སྨྲས་པ། གཞོན་ནུ་བརྒྱ་བྱིན་ལ་སོགས་དང་། །དེ་བཞིན་ལུས་ཅན་གཞན་དག་ཀྱང་། །བདག་ནི་ཚངས་པའི་ལུས་སུ་ཤེས། །ཁྱབ་འཇུག་དེ་ལྟར་ཤེས་པར་གྱིས། །
en: “Sahāṃpati Brahmā said, ‘Boy, “ ‘Other embodied beings Like Kumāra, Indra, and the rest Know me as the embodiment of Brahmā, And so too should you know me, Govinda .’

source: བྲམ་ཟེ་ཆེ་ཞིང་མ་ཐོབ་ཁྱབ་འཇུག་གིས་སྨྲས་པ།
en: “The great, high brahmin Govinda responded in verse:

source: ཚངས་པ་ཁྱོད་ལ་འདུད་པར་བགྱི། །
en: “ ‘Brahmā, I bow down before you.

source: ཚངས་པ་ཁྱོད་ལ་མཆོད་པར་འཚལ། །
en: Brahmā, I worship you.

source: བདག་གི་ཚིག་ནི་གསན་ནས་ཀྱང་། །ལན་ནི་མྱུར་དུ་བཀའ་སྩོལ་ཅིག །
en: Please hear what I say and then Grant your answer without delay.’

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་སྨྲས་པས།
en: “Sahāṃpati Brahmā replied:

source: ཁྱབ་འཇུག་ཁྱོད་ཀྱིས་སྨྲས་པ་ཡི། །ཚིག་ནི་བདག་གིས་གཟུང་བར་བྱ། །
en: “ ‘ Govinda , I shall listen To any word you say.

source: འདྲི་བ་ཡིད་ལ་ཅི་འདོད་པ། །བྲམ་ཟེས་ང་ལ་དྲི་བར་གྱིས། །
en: Brahmin, you may ask me Any question in your heart.

source: ཚེ་འདི་ཡི་ནི་དོན་ཡང་རུང་། །ཕྱི་མའི་ཚེ་ཡི་དོན་ཡང་རུང་། །
en: “ ‘Whether for the sake of this life, Or for the sake of the next,

source: ཁྱོད་ཀྱིས་དྲིས་པ་དེ་དང་དེ། །ངས་ནི་ངེས་པར་དཔྱད་པར་བྱ། །
en: Be assured I shall consider Whatever you see fit to ask.’

source: བྲམ་ཟེ་ཁྱབ་འཇུག་ཆེན་པོས་སྨྲས་པ།
en: “The brahmin Mahā­govinda said:

source: བདག་གི་ཐེ་ཙོམ་གཞན་བརྟགས་ཐེ་ཙོམ་རྣམས། །བྲམ་ཟེ་ཀུན་འགྱེད་གཞོན་ནུ་དྲི་བར་གྱིས། །
en: “ ‘About my doubts and the doubts that others cast, I shall ask you, eternal prince of brahmins.
